SunSunSun-23413011/RX231_Mouse3/RX231_Mouse3.c
/*
* Copyright (c) 2006(2025) Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/***********************************************************************/
/*                                                                     */
/*  FILE        :Main.c or Main.cpp                                    */
/*  DESCRIPTION :Main Program                                          */
/*  CPU TYPE    :                                                      */
/*                                                                     */
/*  History     : 1.00  (2006-10-31)                                   */
/*              : 1.00A (2025-04-11)                                   */
/*                                                                     */
/*  NOTE:THIS IS A TYPICAL EXAMPLE.                                    */
/*                                                                     */
/***********************************************************************/
//***************************************************************
//  ユニバーサルキット 3.0.1 メインプログラム RX231版
//                                          2016/09/26 H. Suzuki   H8版
//                                          2022/09/23 H. Ito      RX220移植
//                                          2026/02/03 T. Kawabata RX231移植
//
//  2026/01/25  Sample. 02 ：LED点滅
//  2026/01/25  Sample. 03 ：LCD表示
//  2026/01/25  Sample. 04 ：Timer W - Dのみ
//  2026/01/25  Sample. 05 ：SW 追加
//  2026/01/25  Sample. 06 ：Mode System 追加
//  2026/01/25  Sample. 07 ：A/D 追加
//  2026/01/28  Sample. 08 ：Sound 追加
//  2026/01/28  Sample. 09 ：Sensor 追加
//  2026/01/28  Sample. 10 ：Motor1(手動駆動) 追加
//  2026/01/28  Sample. 11 ：Motor2(割り込み駆動) 追加
//  2026/01/29  Sample. 12 ：Motor3(姿勢制御), MotorTest 追加
//  2026/01/30  Sample. 13 ：STEP, 1&N区間前進 追加
//  2026/01/31  Sample. 14 ：TURN 追加
//  2026/01/31  Sample. 15 ：迷路周回(探索関数) 追加
//  2026/01/31  Sample. 16 ：左手法 追加
//  2026/01/31  Sample. 17 ：座標更新 追加
//  2026/01/31  Sample. 18 ：マッピング 追加，探索法関数化
//  2026/02/02  Sample. 19 ：拡張左手法 追加
//  2026/02/02  Sample. 20 ：足立法 追加 A/D 修正
//  2026/02/02  Sample. 21 ：二次走行 追加
//  2026/02/04  Modified. 01 ：ゴール選択 追加
//  2026/02/06  Modified. 02 ：Sound 修正
//  2026/02/06  Modified. 03 ：モード分岐を関数ポインタのテーブル化
//  2026/02/06  Modified. 04 ：地図データ,ゴール座標のDF保存/読出し 追加
//  2026/02/09  Modified. 05 ：地図データ削除 追加
//  2026/02/09  Modified. 06 ：速度選択 追加
//  2026/02/12  Modified. 07 ：速度制限 追加
//  2026/02/12  Modified. 08 ：後ろ壁当て, 前壁補正 追加
//
//***************************************************************
#include "typedefine.h"
#include "Pin.h"
#include "iodefine.h"
#include "LCDrx231.h"
#include "Config_S12AD0.h"
#include <stdint.h>
#include "src/smc_gen/r_datfrx_rx/r_flash_dm_rx_if.h"
#include "Sound.h"
#include "Coconut_Mall_2.h"
#ifdef __cplusplus
//#include <ios>                        // Remove the comment when you use ios
//_SINT ios_base::Init::init_cnt;       // Remove the comment when you use ios
#endif

void main(void);
#ifdef __cplusplus
extern "C" {
void abort(void);
}
#endif

//---------------------------------------------------------------
//  型宣言
//---------------------------------------------------------------
#define  uchar    unsigned char
#define  ushort   unsigned short
#define  vshort   volatile short
#define  vushort  volatile unsigned short
typedef uint16_t u16;
typedef uint32_t u32;
typedef void (*mode_func_t)(int);

//-------------------------------------------------------------------------
//  マクロ定義
//-------------------------------------------------------------------------
// スイッチ関連
#define   SW_ON       0    // スイッチON (Active Low)
#define   SW_OFF      1    // スイッチOFF
#define   KEY_OFF   200    // スイッチ用チャタリングキャンセル時間
// モード関連
#define   DISP        0    // モード表示
#define   EXEC        1    // モード実行
#define   ModeMax     ( g_mode_table_count ) // 動作モード数
// センサ関連
#define   LED_ON      1    // センサ用LED点燈
#define   LED_OFF     0    // センサ用LED消灯
// モータ関連
#define   LeftGo      1    // 左モータ前進
#define   LeftBack    0    // 左モータ後進
#define   RightGo     0    // 右モータ前進
#define   RightBack   1    // 右モータ後進
#define ACC_TABLE_SIZE   (2000u)
#define ACC_TABLE_BASE   (300u)
#define ACC_TABLE_STEP   (4u)
#define ACC_TABLE_MIN    (ACC_TABLE_BASE)
#define ACC_TABLE_MAX    (ACC_TABLE_BASE + (ACC_TABLE_SIZE - 1u) * ACC_TABLE_STEP)
// 探索関連
#define   S_MODE      0    // Search Mode : 未探索区間は壁無しとして扱う
#define   T_MODE      1    // Try Mode    : 未探索区間は壁有りとして扱う
#define MAP_DATA_NO (0)
#define GOAL_DATA_NO (1)
#define MAP_DATA_SLOTS (1u)
#define MAP_DATA_BYTES (16u*16u)
#define GOAL_DATA_MAGIC (0xA0u)
#define GOAL_DATA_MAGIC_MASK (0xE0u)
#define GOAL_DATA_INDEX_MASK (0x1Fu)
#define FLASH_DM_WORK_WORDS (64u)

//---------------------------------------------------------------
//  グローバル変数定義
//---------------------------------------------------------------
vushort  wait_timer = 0;   // 内部時計( msec ) : wait関数用カウンタ
ushort   SENSOR_PT;        // 割り込み回数カウント用ポインタ
int      MODE = 0;         // 現在モード格納用
volatile uint16_t g_s12ad0_ch000_value;
volatile uint16_t g_s12ad0_ch001_value;
volatile uint16_t g_s12ad0_ch002_value;
volatile uint16_t g_s12ad0_ch017_value;
vshort   Batt;             // 電池の電圧
static int st_nSoundRPos;
static SOUND_T* st_pSound;
static SOUNDSTAT_T SoundStatus;
// センサの事前値格納用
int16_t  R_PRE;           // 右センサの値
int16_t  L_PRE;           // 左センサの値
int16_t  F_PRE;           // 前センサの値
// センサの現在値格納用
int16_t  R_SEN;           // 右センサの値
int16_t  L_SEN;           // 左センサの値
int16_t  F_SEN;           // 前センサの値
// センサのON/OFF用
short    R_SW;            // 右センサのスイッチ
short    L_SW;            // 左センサのスイッチ
short    F_SW;            // 前センサのスイッチ
// センサのしきい値
short    R_REF;            // 右センサしきい値
short    L_REF;            // 左センサしきい値
short    F_REF;            // 前センサしきい値
// 壁の有無判定用しきい値
short    R_LIM;            // 右壁有無しきい値
short    L_LIM;            // 左壁有無しきい値
short    F_LIM;            // 前壁有無しきい値
short    F_LIM2;           // 2マス先前壁有無しきい値
short    F_LIM_SLA;        // スラローム用前壁有無しきい値
// モータ関連
ushort   timerL;           // 左タイマー設定値
ushort   timerR;           // 右タイマー設定値
short    ldir;             // 左モータ回転方向
short    rdir;             // 右モータ回転方向
short    speed;            // 目標速度
short    speed_now;        // 現在速度
short    MotorTimer;       // モータ電源コントロールタイマー
short    control_mode;     // 姿勢制御モード  0:なし  1:あり
short    Global_Speed;     // グローバル速度
short    SLALOM_INNER_SPEED;  // スラローム内輪速度
// 走行関連
short    STEP;             // モータのステップ数
short    GO_STEP;          // 1区間のステップ数
short    HALF_STEP;        // 半区間のステップ数
short    TURN_STEP;        // 超信旋回ステップ数
short    SLALOM_STEP_FORWARD;   // スラローム旋回ステップ数（内側）
short    SLALOM_STEP_OUT;  // スラローム旋回ステップ数（外側）
short    zerozero;         // (0,0)スタートフラグ
//ステップ数(割り込み内でカウントアップ) 
volatile unsigned int step_r;		//右モータ用
volatile unsigned int step_l;			//左モータ用
short stepf_r = 1;
short stepf_l = 1;
// 探索関連
uchar    head;             // マウスの進行方向 0:北 1:東 2:南 3:西
uchar    head_change;      // 進行方向更新用変数 0:前 1:右 2:後 3:左
uchar    pos_x;            // マウスの現在座標 x
uchar    pos_y;            // マウスの現在座標 y
uchar    map[16][16];      // MAPデータ
uchar    p_map[16][16];    // ポテンシャルMAPデータ
int      goal[2] = {8,8}; // ゴール座標
int      goals[][2] = { {3,3}, {7,7}, {7,8}, {8,7}, {8,8} }; // ゴール座標リスト
int      GOAL_NUM = sizeof(goals) / (sizeof(goals[0])); // ゴール数
static	volatile	e_flash_dm_status_t	g_flash_dm_last	=	FLASH_DM_SUCCESS;
static	volatile	uint8_t	g_flash_dm_done	=	0;
static	uint8_t	g_flash_dm_ready	=	0;
static	uint32_t	g_flash_dm_work[FLASH_DM_WORK_WORDS];
//---------------------------------------------------------------
//  関数プロトタイプ宣言
//---------------------------------------------------------------
void IO_init( void );
void load_param( void );
void pause( int x );
void int_timerw( void );
void int_mot_r(void);
void int_mot_l(void); 
void WaitKeyOff( void );
void change_mode( int x );
void exec_mode( void );
void mode0( int x );
void mode1( int x );
void mode2( int x );
void mode3( int x );
void mode4( int x );
void mode5( int x );
void mode6( int x );
void mode7( int x );
void mode8( int x );
void mode9( int x );
void mouse_search( int goal_x, int goal_y, int speed, int mode );
void slalom_search( int goal_x, int goal_y, int speed, int mode );
void Int_MTU1_TGIA1(void); // MTU1割り込み関数プロトタイプ
u16 AccTableGet(u16 index); // 加速テーブル取得関数プロトタイプ
void com_go( int n );
void com_go_half( int n );
void com_stop( void );
void com_back( int n );
void com_turn( int t_mode );
void com_slalom_turn( int t_mode );
void back_wall_set( void );
void kbat_lf_turn( void );
void goal_kbat_turn( void );
void countdown( void );
int get_wall_data( void );
void clear_map( void );
void make_map_data( void );
void make_potential( int goal_x, int goal_y, int mode );
int search_left_hand( void );
int search_ex_left_hand( void );
int search_adachi( void );
int map_writeDF( short no );
void map_DFread( short no );
int goal_writeDF( void );
int goal_DFread( int *gx, int *gy );
int goal_find_index( int gx, int gy );
void select_goal(int *gx, int *gy); // ゴール選択関数プロトタイプ
void select_speed(short *speed);      // 速度選択関数プロトタイプ

//---------------------------------------------------------------
//  メインプログラム
//---------------------------------------------------------------
void main(void){
    IO_init();      // RX231初期化
    LCD_init();    // LCD初期化
    PIN_WRITE(CPU_LED) = 1;    // LED消灯
    PIN_WRITE(LED) = LED_OFF;                        // LEDを消灯
    Start_Sound(98); // 起動音再生
    // タイトル表示
    LCD_print( 0, "Modded08" );

    // 電圧表示
    LCD_print( 8, "   .  v " );
    LCD_dec_out( 9, Batt/100, 1);    // 十の位を表示
    Batt %= 100;                     // 十の位を削除
    LCD_dec_out(10, Batt/10 , 1);    // 一の位を表示
    Batt %= 10;                      // 一の位を削除
    LCD_dec_out(12, Batt    , 1);    // 残った小数値を表示
    pause( 2000 );
    clear_map();                     // MAPデータ初期化
    load_param();                    // load parameters
    if(!goal_DFread(&goal[0], &goal[1])){ (void)goal_writeDF(); } // load goal from DF
    change_mode( 0 );                // まず初期画面にする = Mode0
    
    // メインループ
    while( 1 ){
      if( PIN_READ( SW_UP ) == SW_ON ){          // 上SWが押されている場合
        WaitKeyOff();                // チャタリング防止処理
        change_mode(+1);             // モード+1
      }else if( PIN_READ( SW_DOWN ) == SW_ON ){  // 下SWが押されている場合
        WaitKeyOff();                // チャタリング防止処理
        change_mode(-1);             // モード-1
      }else if( PIN_READ( SW_EXEC ) == SW_ON ){  // 実行SWが押されている場合
        WaitKeyOff();                // チャタリング防止処理
        Start_Sound(99); // 実行音再生
        exec_mode();                 // モード実行
        MODE = 0;
        change_mode( 0 );            // 実行後は初期画面に戻す
      }
      // モードが0ならセンサデータをLCD表示
      if( MODE == 0 ){
        LCD_dec_out(  2, F_SEN, 4 ); // 前センサ値をLCD上中央に表示
        LCD_dec_out(  9, L_SEN, 3 ); // 左センサ値をLCD左下に表示
        LCD_dec_out( 13, R_SEN, 3 ); // 右センサ値をLCD右下に表示
      }
    }
}

//---------------------------------------------------------------
//  RX231初期化
//---------------------------------------------------------------
void IO_init( void ){
    R_Systeminit();
    R_Pins_Create();
    PIN_WRITE(CPU_LED) = 0;    // LED点灯
    PIN_WRITE(MOTOR_EN) = 0; // モータOFF
    R_Config_CMT0_Start(); // CMT0開始

    R_Config_S12AD0_Start(); // ADC開始
    while (S12AD.ADCSR.BIT.ADST); // AD変換完了待ち
    R_Config_S12AD0_Get_ValueResult(ADCHANNEL17, (uint16_t *)&g_s12ad0_ch017_value);
    Batt = g_s12ad0_ch017_value / 8.4; // 電池電圧値取得
    R_SW = LED_ON;             // 右センサON
    L_SW = LED_ON;             // 左センサON
    F_SW = LED_ON;             // 前センサON
}

//---------------------------------------------------------------
//  パラメータ読み込み
//---------------------------------------------------------------
void load_param( void ){
  // センサしきい値の決め打ち
  R_REF   = 270;    // 区画中央での右センサ値
  L_REF   = 380;    // 区画中央での左センサ値
  F_REF   = 1600;   // 区画中央での前センサ値
  // 壁の有無判定用しきい値:各センサ壁あり最小値と壁なし値の中間値
  R_LIM   = 150;    // 右
  L_LIM   = 200;    // 左
  F_LIM   = 280;    // 前
  F_LIM2  = 200;    // 2マス先前
  F_LIM_SLA = 630;  // スラローム用前壁
  //走行パラメータ
  GO_STEP = 1600;   // 1区間のステップ数
  HALF_STEP = 600; // 半区間のステップ数
  TURN_STEP = 550;  // 旋回ステップ数
  SLALOM_STEP_FORWARD = 10; // スラローム内側ステップ数
  SLALOM_STEP_OUT = 600; // スラローム外側ステップ数
  SLALOM_INNER_SPEED = 10; // スラローム内輪速度
  Global_Speed = 900; // グローバル速度
  zerozero = 0; // (0,0)スタートフラグ初期化
}

//---------------------------------------------------------------
//  Timer W 割り込み(200us毎にこの関数が勝手に優先して実行される)
//---------------------------------------------------------------
//Config_CMT0_user.cから呼び出される
void int_timerw( void ){
    int err_l, err_r;
    ushort acc_num, lspeed, rspeed;
    //左モーター割り込み
    MTU3.TGRC = timerL; //次の速度設定
    if(speed){
      R_Config_MTU3_Start(); // カウント開始
    }else{ //停止時
      R_Config_MTU3_Stop(); // カウント停止
    }
    if(ldir == 0){
      PIN_WRITE(L_MOT_MODE) = LeftGo; //正転
    }else{
      PIN_WRITE(L_MOT_MODE) = LeftBack; //反転
    }
    //右モーター割り込み
    MTU4.TGRC = timerR; //次の速度設定
    if(speed){
      R_Config_MTU4_Start(); // カウント開始
    }else{ //停止時
      R_Config_MTU4_Stop(); // カウント停止
    }
    if(rdir == 0){
      PIN_WRITE(R_MOT_MODE) = RightGo; //正転
    }else{
      PIN_WRITE(R_MOT_MODE) = RightBack; //反転
    }
    //モータスピード割り込み
    if((stepf_r == 1) || (stepf_l == 1)){
      stepf_l = 0;
      stepf_r = 0;
      //モータの加速処理
      if(speed == 0){ //モータ停止中の処理
        speed_now = 0; //速度を0にする
        timerL = 2500; //左 割り込み周期2ms 1/(0.8e-6x2500) = 500Hz
        MTU3.TGRC = timerL;
        timerR = 2500; //右
        MTU4.TGRC = timerR;
      }else{
        if(speed > speed_now) speed_now++; //加速
        else if(speed < speed_now) speed_now--; //減速
        if(speed_now >= 2000) speed_now = 1999; //最高速度
        if(speed_now < 0) speed_now = 0; //最低速度
        acc_num = AccTableGet((u16)speed_now); //加速度テーブルから値取得
        //姿勢制御
        if(control_mode == 1){
          //偏差を計算
          err_l = L_SEN - L_REF; //左偏差を計算
          err_r = R_SEN - R_REF; //右偏差を計算
          //壁情報から偏差を加工
          if(L_SEN > L_LIM || R_SEN > R_LIM){
            //どちらかに壁がある:偏差が大きい側を優先して補正
            if(err_l > err_r)
              err_r = -1 * err_l;
            else
              err_l = -1 * err_r;
          }else{
            //両方壁なし:補正なし
            err_l = 0;
            err_r = 0;
          }
          //偏差を用いて補正
          lspeed = acc_num + err_l;
          rspeed = acc_num + err_r;
      }else if(control_mode == 2){ // 右旋回スラローム
          lspeed = acc_num;
          rspeed = SLALOM_INNER_SPEED;
      }else if(control_mode == 3){ // 左旋回スラローム
          lspeed = SLALOM_INNER_SPEED;
          rspeed = acc_num;
      }else{  // control_mode = 0
          lspeed = acc_num;
          rspeed = acc_num;
      }
      //タイマー設定値計算
      timerL =  1500000L / lspeed; // lspeedが大きい程周期が短くなる
      timerR =  1500000L / rspeed; // rspeedが大きい程周期が短くなる
      }
    }
    // センサ処理

    SENSOR_PT++;                 // タスクポインタの更新
    if( SENSOR_PT == 5 ) SENSOR_PT = 0;  // 0-4の5カウント:200us*5=1ms
                               // 各処理は1ms周期で実行される
    switch( SENSOR_PT ){          // タスクポインタに従って処理を行う
      case 0:  // 1msecタイマー&LCDの更新
              wait_timer++;     // wait関数用カウンタ
              LCD();            // LCD更新処理
              break;
      case 1: break;
      case 2: break;
      case 3: if ( (R_SW == LED_OFF) && (L_SW == LED_OFF) && (F_SW == LED_OFF) ) break;
               // センサ値取得処理
              R_Config_S12AD0_Start(); // ADC開始
               while (S12AD.ADCSR.BIT.ADST); // AD変換完了待ち
               if(R_SW == LED_ON){
                R_Config_S12AD0_Get_ValueResult(ADCHANNEL0, (uint16_t *)&g_s12ad0_ch000_value);
                R_PRE = g_s12ad0_ch000_value;
                }
               if(L_SW == LED_ON){
                R_Config_S12AD0_Get_ValueResult(ADCHANNEL1, (uint16_t *)&g_s12ad0_ch001_value);
                L_PRE = g_s12ad0_ch001_value;
                }
               if(F_SW == LED_ON){
                R_Config_S12AD0_Get_ValueResult(ADCHANNEL2, (uint16_t *)&g_s12ad0_ch002_value);
                F_PRE = g_s12ad0_ch002_value;
                }
                PIN_WRITE(LED) = LED_ON;                         // LEDを点灯
                LCD_wait(20);                         // しばらく待つ
              R_Config_S12AD0_Start(); // ADC開始
               while (S12AD.ADCSR.BIT.ADST); // AD変換完了待ち
               if(R_SW == LED_ON){
                R_Config_S12AD0_Get_ValueResult(ADCHANNEL0, (uint16_t *)&g_s12ad0_ch000_value);
                R_PRE = ((g_s12ad0_ch000_value) - R_PRE) / 2;     //11bit化
                if( R_PRE < 0 )        R_SEN = 0;    // 表示上限処理
                else if( R_PRE <= 999 ) R_SEN = R_PRE;
                else                R_SEN = 999;
                }
               if(L_SW == LED_ON){
                R_Config_S12AD0_Get_ValueResult(ADCHANNEL1, (uint16_t *)&g_s12ad0_ch001_value);
                L_PRE = ((g_s12ad0_ch001_value) - L_PRE) / 4;   //10bit化 ← 左センサ飽和したため。機体に合わせて要変更。
                if( L_PRE < 0 )        L_SEN = 0;    // 表示上限処理
                else if( L_PRE <= 999 ) L_SEN = L_PRE;
                else                L_SEN = 999;
                }
               if(F_SW == LED_ON){
                R_Config_S12AD0_Get_ValueResult(ADCHANNEL2, (uint16_t *)&g_s12ad0_ch002_value);
                F_PRE = ((g_s12ad0_ch002_value) - F_PRE) / 2;  //11bit化
                if( F_PRE < 0 )         F_SEN = 0;
                else if( F_PRE <= 9999 ) F_SEN = F_PRE;
                else                F_SEN = 9999;        // 表示上限処理
                }
                PIN_WRITE(LED) = LED_OFF;                        // LEDを消灯
               break;
      case 4:  // モータ用電源コントロール
               if( speed != 0 ) MotorTimer = 3000;   // モータ動作時はタイマーセット
               else             MotorTimer--;        // モータ停止時はカウントダウン
               if( MotorTimer < 0 )  MotorTimer =  0;
               // モータを動かさない時は電源をOFF(モータ停止から3秒後)
               if( MotorTimer == 0 )  PIN_WRITE(MOTOR_EN)   =  0;  // OFF
               else                   PIN_WRITE(MOTOR_EN)   =  1;  // ON
               break;
      default: break;
    }
}

//---------------------------------------------------------------
//  モータステップ数カウント関数
//---------------------------------------------------------------
void int_mot_r(void){	//右モータが１ステップ進む毎の割り込み
	step_r++;			//ステップ数をカウント
  stepf_r = 1;			// 
  STEP++;                     // 距離カウンタ更新 
}

void int_mot_l(void){	//左モータが１ステップ進む毎の割り込み
	step_l++;			//ステップ数をカウント
  stepf_l = 1;			//  
  STEP++;                    // 距離カウンタ更新 
}

//---------------------------------------------------------------
//  MTU1 割り込み(38us毎にこの関数が勝手に優先して実行される)
//---------------------------------------------------------------
//config_MTU1_user.cから呼び出される
void Int_MTU1_TGIA1(void){
  if(SoundStatus.BIT.SOUND_SP == 1){
    SoundStatus.BIT.SOUND_SP = 0;
    SoundStatus.BIT.SOUND_IT = 0;
    st_nSoundRPos = 0;
  }
  if(st_pSound[st_nSoundRPos].NOTES == STP_){//終端マークで終了
    Stop_Sound();
  }else if (st_pSound[st_nSoundRPos].NOTES == RPT_){//繰り返しマークでSPACEフラグセット
    SoundStatus.BIT.SOUND_SP = 1;
    MTU0.TIORH.BIT.IOB = 0; // MTIOC0B端子を出力禁止にする（Hi-Zになる）
    MTU1.TGRA = T02_; // １秒の無音時間
  }else {
    if(SoundStatus.BIT.SOUND_IT == 0){//発音中の場合
      SoundStatus.BIT.SOUND_IT = 1;
      if(st_pSound[st_nSoundRPos].NOTES == RST_){//休符ならMTIOC0B端子の出力禁止
        MTU0.TIORH.BIT.IOB = 0; // MTIOC0B端子を出力禁止にする（Hi-Zになる）
      }else{//音符なら指定の音階を出力
        uint16_t note = (uint16_t)st_pSound[st_nSoundRPos].NOTES;
        /* TGRAを周期、TGRBを50%デューティに設定 */
        MTU0.TGRA = note;
        MTU0.TGRB = (uint16_t)(note / 2U);
        MTU0.TIORH.BIT.IOB = 3; // MTIOC0B端子をトグル出力にする
      }
      MTU1.TGRA = (uint16_t)(st_pSound[st_nSoundRPos].TIME - TIT_); // 音の時間（長さ）をセット
      st_nSoundRPos++;
    }else{//区切り
      SoundStatus.BIT.SOUND_IT = 0;
      MTU0.TIORH.BIT.IOB = 0; // MTIOC0B端子を出力禁止にする（Hi-Zになる）
      MTU1.TGRA = TIT_;
    }
  }
}

//---------------------------------------------------------------
//  wait関数(1msタイマー)
//---------------------------------------------------------------
void pause( int x ){
  wait_timer = 0;
  while( wait_timer != x ); // 終了時間まで待つ
}

//-------------------------------------------------------------------------
//  キーオフ処理
//-------------------------------------------------------------------------
void WaitKeyOff( void ){
  // チャタリング防止処理
  pause( KEY_OFF );             // 設定した時間([ms])待つ
  // 全てのスイッチがOFFになるまでループして待つ
  while((  PIN_READ( SW_UP ) == SW_ON )||( PIN_READ( SW_DOWN ) == SW_ON )||( PIN_READ( SW_EXEC ) == SW_ON )||( PIN_READ( SW_RETURN ) == SW_ON ));
}

//-------------------------------------------------------------------------
//  モード表示
//-------------------------------------------------------------------------
//  モードテーブル
static const mode_func_t g_mode_table[] = {
  mode0, mode1, mode2, mode3, mode4, mode5, mode6, mode7, mode8, mode9
};
