SunSunSun-23413011/RX231_Mouse3/RX231_Mouse3.c
static const int g_mode_table_count = (int)(sizeof(g_mode_table) / sizeof(g_mode_table[0]));

void change_mode( int x ){
  MODE += x;                            // モード更新
  if( MODE >= ModeMax ) MODE = 0;       // モードが超えている場合は0に戻す
  if( MODE < 0 )  MODE = ModeMax - 1;   // モードが負の場合はモードを最大値に設定

  g_mode_table[ MODE ]( DISP );
}

//-------------------------------------------------------------------------
//  モード処理
//-------------------------------------------------------------------------
void exec_mode( void ){
  g_mode_table[ MODE ]( EXEC );
}

//-------------------------------------------------------------------------
//  Mode0 : センサチェック
//-------------------------------------------------------------------------
void mode0( int x ){
  if( x == DISP ){  // DISPモードの場合
    // モード内容表示
    LCD_print( 0, "0:Sensor" );
    LCD_print( 8, "        " );
    pause(1000);
    LCD_print( 0, " F      " );
    LCD_print( 8, "L   R   " );
    return;                     // 以下の実行処理をしないで戻る
  }

  // 実行モードの場合
  L_REF = 0; R_REF = 0;         // データ初期化

  for( x = 0; x < 32; x++ ){     // データ測定(64ポイント)
    L_REF += L_SEN;
    R_REF += R_SEN;
    pause(1);
  }

  R_REF = R_REF / 32;           // 測定データを平均化
  L_REF = L_REF / 32;

  LCD_print( 0, " L    R " );
  LCD_print( 8, "        " );
  LCD_dec_out(  8, L_REF, 3 );  // 左センサ値をLCDに表示
  LCD_dec_out( 13, R_REF, 3 );  // 右センサ値をLCDに表示

  pause( 2000 );                // 2秒間表示
}

//-------------------------------------------------------------------------
//  Mode1 : 
//-------------------------------------------------------------------------
void mode1(int x){
  if( x == DISP ){  // DISPモードの場合
    // モード内容表示
    LCD_print( 0, "1:M-TEST" );
    LCD_print( 8, "        " );
    return;                     // 以下の実行処理をしないで戻る
  }

  // 実行モードの場合
  LCD_print( 8,"SPD=     ");
  rdir = 0; ldir = 0;           // 回転方向を直進
  control_mode = 1;             // 直線走行用姿勢制御あり
  while(1){
    LCD_dec_out( 12, speed, 4 );
    if( PIN_READ(SW_UP)   == 0 ) { speed += 100; WaitKeyOff(); }
    if( PIN_READ(SW_DOWN) == 0 ) { speed -= 100; WaitKeyOff(); }
    if( PIN_READ(SW_EXEC) == 0 ) { speed = 0; break; }
    if( speed > 2000 )    speed = 2000;
    else if( speed < 0 )  speed = 0;
  }
  return;
}

//-------------------------------------------------------------------------
//  Mode2 : 
//-------------------------------------------------------------------------
void mode2(int x){
  if( x == DISP ){  // DISPモードの場合
    // モード内容表示
    LCD_print( 0, "2: 1 GO " );
    LCD_print( 8, "STEP    " );
    return;                     // 以下の実行処理をしないで戻る
  }

  // 実行モードの場合
  while(1){
    LCD_dec_out( 12, GO_STEP, 4 );
    if( PIN_READ(SW_UP)   == 0 ) { GO_STEP += 10; WaitKeyOff(); }
    if( PIN_READ(SW_DOWN) == 0 ) { GO_STEP -= 10; WaitKeyOff(); }
    if( PIN_READ(SW_EXEC) == 0 ) { WaitKeyOff();  com_go( 1 );  com_stop(); }
    if( PIN_READ(SW_RETURN) == 0 ) { break; }
  }
  return;
}

//-------------------------------------------------------------------------
//  Mode3 : N区間前進
//-------------------------------------------------------------------------
void mode3(int x){
  int n = 5;                    // 前進区間数：初期値 5
  if( x == DISP ){  // DISPモードの場合
    // モード内容表示
    LCD_print( 0, "3: N GO " );
    LCD_print( 8, "     N  " );
    return;                     // 以下の実行処理をしないで戻る
  }

  // 実行モードの場合
  LCD_dec_out( 8, GO_STEP, 4 );
  while(1){
    LCD_dec_out( 14, n, 2 );
    if( PIN_READ(SW_UP)   == 0 ) { n++; WaitKeyOff(); }
    if( PIN_READ(SW_DOWN) == 0 ) { n--; WaitKeyOff(); }
    if( PIN_READ(SW_EXEC) == 0 ) { WaitKeyOff();  com_go( n );  com_stop(); }
    if( PIN_READ(SW_RETURN) == 0 ) { break; }
  }
  return;
}

//-------------------------------------------------------------------------
//  Mode4 : 180ターンR
//-------------------------------------------------------------------------
void mode4( int x ){
  if( x == DISP )  // DISPモードの場合
  {
    // モード内容表示
    LCD_print( 0, "4: TURN " );
    LCD_print( 8, "        " );
    return;                     // 以下の実行処理をしないで戻る
  }

  // 実行モードの場合
  while(1){
    LCD_dec_out( 10, TURN_STEP, 4 );
    if( PIN_READ(SW_UP)   == 0 ) { TURN_STEP += 10; WaitKeyOff(); }
    if( PIN_READ(SW_DOWN) == 0 ) { TURN_STEP -= 10; WaitKeyOff(); }
    if( PIN_READ(SW_EXEC) == 0 ) { com_turn(2); com_stop(); }
    if( PIN_READ(SW_RETURN) == 0 ) { break; }
  }
  return;
}

//-------------------------------------------------------------------------
//  Mode5 : 探索走行
//-------------------------------------------------------------------------
void mode5( int x ){
  if( x == DISP ){  // DISPモードの場合
    // モード内容表示
    LCD_print( 0, "5:Search" );
    LCD_print( 8, "Spd     " );
    LCD_dec_out(12, Global_Speed, 4);
    return;                     // 以下の実行処理をしないで戻る
  }

  // 実行モードの場合
  select_speed(&Global_Speed); // 速度選択
  countdown();               // カウントダウン
  pos_x = 0; pos_y = 0; head = 0; // 
  Start_Sound(3);
  mouse_search( goal[0], goal[1], Global_Speed, S_MODE );
  (void)map_writeDF(MAP_DATA_NO);
  mouse_search(0, 0, Global_Speed, S_MODE);
  (void)map_writeDF(MAP_DATA_NO);
  Start_Sound(96);
}

//-------------------------------------------------------------------------
//  Mode6 : 二次走行
//-------------------------------------------------------------------------
void mode6( int x ){
  if( x == DISP )  // DISPモードの場合
  {
    // モード内容表示
    LCD_print( 0, "6:Try   " );
    LCD_print( 8, "Spd     " );
    LCD_dec_out(12, Global_Speed, 4);
    return;                     // 以下の実行処理をしないで戻る
  }

  // 実行モードの場合
  select_speed(&Global_Speed); // 速度選択
  // 二次走行
  countdown();           // カウントダウン
  pos_x = 0; pos_y = 0; head = 0;
  Start_Sound(3);
  map_DFread(MAP_DATA_NO);
  slalom_search( goal[0], goal[1], Global_Speed, T_MODE );
  slalom_search( 0, 0, Global_Speed, T_MODE );
  Start_Sound(96);
}


//-------------------------------------------------------------------------
//  Mode7 : Sound再生
//-------------------------------------------------------------------------
void mode7(int x){
  int sound_no = 1;          // 再生サウンド番号：初期値 1
  if( x == DISP ){  // DISPモードの場合
    // モード内容表示
    LCD_print( 0, "7: Sound" );
    LCD_print( 8, "No.     " );
    return;                     // 以下の実行処理をしないで戻る
  }

