SunSunSun-23413011/RX231_Mouse3/RX231_Mouse3.c
  // 実行モードの場合
  while(1){
    LCD_dec_out( 12, sound_no, 4 );
    if( PIN_READ(SW_UP)   == 0 ) {
      if(sound_no < 99) sound_no++;
      else if(sound_no == 99) sound_no = 1;
      WaitKeyOff(); 
    }
    if( PIN_READ(SW_DOWN) == 0 ) { 
      if(sound_no > 1) sound_no--;
      else if(sound_no == 1) sound_no = 99;
      WaitKeyOff(); 
    }
    if( PIN_READ(SW_EXEC) == 0 ) { Start_Sound(sound_no); WaitKeyOff(); }
    if( PIN_READ(SW_RETURN) == 0 ) { break; }
  }
  return;
}

//-------------------------------------------------------------------------
//  Mode8 : ゴール選択
//-------------------------------------------------------------------------
void mode8(int x){
  int old_goal_x;
  int old_goal_y;
  if( x == DISP ){  // DISPモードの場合
    // モード内容表示
    LCD_print( 0, "8: Goal " );
    LCD_print(8, "x:  y:  ");
    LCD_dec_out(10, goal[0], 1);
    LCD_dec_out(14, goal[1], 1);
    return;                     // 以下の実行処理をしないで戻る
  }

  // 実行モードの場合
  old_goal_x = goal[0];
  old_goal_y = goal[1];
  select_goal(&goal[0], &goal[1]);
  if( goal[0] != old_goal_x ){
    (void)goal_writeDF();
  }else if( goal[1] != old_goal_y ){
    (void)goal_writeDF();
  }
  return;
}

//-------------------------------------------------------------------------
//  Mode9 : MAP clear (RAM/DF)
//-------------------------------------------------------------------------
void mode9(int x){
  if( x == DISP ){  // DISP mode
    LCD_print( 0, "9:MapClr" );
    LCD_print( 8, "RAM+ROM " );
    return;
  }

  // EXEC mode
  LCD_print( 0, "Map Clr " );
  clear_map();  // clear RAM map
  if(map_writeDF(MAP_DATA_NO)){  // overwrite DF map with initial map
    LCD_print( 8, "Done    " );
    Start_Sound(99);
  }else{
    LCD_print( 8, "NG      " );
  }
  pause(800);
  return;
}

//-------------------------------------------------------------------------
//  探索関数
//-------------------------------------------------------------------------
void mouse_search( int goal_x, int goal_y, int spd, int mode ){
  short x, y, block_count, motion, next_motion;
  if( pos_x == 0 && pos_y == 0 ){
    back_wall_set();
    zerozero = 1;
  }
  while( 1 ){
    // １つのループは区間中心から次の区間中心まで
    // 最初に半区画直進
    control_mode = 1;             // 姿勢制御ON
    rdir = 0; ldir = 0;           // 回転方向を直進
    STEP = 0;                     // 距離カウンタリセット

    // 座標更新
    if     ( head == 0 ) pos_y++; // 北向き y+1
    else if( head == 1 ) pos_x++; // 東向き x+1
    else if( head == 2 ) pos_y--; // 南向き y-1
    else if( head == 3 ) pos_x--; // 西向き x-1

        // ポテンシャルMAP計算
    make_potential( goal_x, goal_y, mode );

    next_motion = search_adachi();  // 次の行動予測
    if ( (F_SEN > F_LIM2 || next_motion == 1 || next_motion == 3) && spd > 700 ) speed = 700; // 2マス先に壁がある場合は速度制限
    else  speed = spd;                  // 速度設定

    if( zerozero == 1 ){  // (0,0)スタート時のみ
      while( STEP < HALF_STEP );  // 半区間進む
      step_l = 0;                        //左ステップ数をリセット
      step_r = 0;                        //右ステップ数をリセット
      STEP = 0;                     // 距離カウンタリセット
      zerozero = 0;
    }
    while( STEP < GO_STEP / 2 );  // 半区間進む

    // 柱まで進んだら
    // 壁情報取得＆MAPデータ上書き
    if(mode == S_MODE) make_map_data();

    // 左手法で探索して行動決定
    motion = search_adachi();

    // ゴール時の例外処理（上で決めた行動が上書きされる）
    if( pos_x == goal_x && pos_y == goal_y )
      motion = 4;                       // ゴール到達：反転停止

    // 行動を実行
    switch( motion ){
      // 直進
      case  0 : while( STEP < GO_STEP );  // 残り半区間進む
                head_change = 0;          // 進行方向更新変数を前に設定
                break;
      // 右折
      case  1 : while( STEP < GO_STEP - speed_now * 2 && F_SEN < F_REF );  // 減速域を残して直進
                speed = 1;
                while( STEP < GO_STEP && F_SEN < F_REF );  // 残りステップ数で減速
                com_turn( 0 );            // 右90度旋回
                head_change = 1;          // 進行方向更新変数を右に設定
                break;
      // 反転
      case  2 : while( STEP < GO_STEP - speed_now * 2 && F_SEN < F_REF );  // 減速域を残して直進
                speed = 1;
                while( STEP < GO_STEP && F_SEN < F_REF );  // 残りステップ数で減速
                kbat_lf_turn();            // 反転
                head_change = 2;          // 進行方向更新変数を後に設定
                break;
      // 左折
      case  3 : while( STEP < GO_STEP - speed_now * 2 && F_SEN < F_REF );  // 減速域を残して直進
                speed = 1;
                while( STEP < GO_STEP && F_SEN < F_REF );  // 残りステップ数で減速
                com_turn( 1 );            // 左90度旋回
                head_change = 3;          // 進行方向更新変数を左に設定
                break;
      // 反転停止
      case  4 : while( STEP < GO_STEP - speed_now * 2 && F_SEN < F_REF );  // 減速域を残して直進
                speed = 1;
                while( STEP < GO_STEP && F_SEN < F_REF );  // 残りステップ数で減速
                goal_kbat_turn();         // 反転(ゴール壁当て)
                com_stop();               // 停止
                head_change = 2;          // 進行方向更新変数を後に設定
                head = ( head + head_change ) & 0x03; // 詳細は下を参照
                // MAPデータ確認（既探索の区画数を表示してみる）
                block_count = 0;
                for( y = 0 ; y < 16 ; y++ ){
                  for( x = 0 ; x < 16 ; x++ ){
                    if( ( map[ x ][ y ] & 0xf0 ) == 0xf0 )
                      block_count++;
                  }
                }
                // LCD_print( 0, "        " );
                // LCD_print( 8, "  Blocks" );
                // LCD_dec_out(  2, block_count, 3 );  // 既探索数を表示
                // pause( 3000 );

                return;                   // ループ終了
                break;
      // その他
      default : com_stop();               // 停止
                head_change = 0;          // 進行方向更新変数を前に設定
                head = ( head + head_change ) & 0x03; // 詳細は下を参照
                return;                   // ループ終了
                break;
    }
    
    // 進行方向更新変数head_changeを用いて現在の進行方向headを更新
    head = ( head + head_change ) & 0x03; // 更新数値を加算して2進数下2桁でマスク
                                          // 00 -> 01 -> 10 -> 11 -(マスク)-> 00
  }
}

//-------------------------------------------------------------------------
//  スラローム探索関数
//-------------------------------------------------------------------------
void slalom_search( int goal_x, int goal_y, int spd, int mode ){
  short x, y, block_count, motion, next_motion, prev_motion;
  prev_motion = 0;
  if( pos_x == 0 && pos_y == 0 ){
    back_wall_set();
    zerozero = 1;
  }
  while( 1 ){
    control_mode = 1;             // 姿勢制御ON
    rdir = 0; ldir = 0;           // 回転方向を直進
    STEP = 0;                     // 距離カウンタリセット
    speed = spd;                  // 速度設定

    // 座標更新
    if     ( head == 0 ) pos_y++;
    else if( head == 1 ) pos_x++;
    else if( head == 2 ) pos_y--;
    else if( head == 3 ) pos_x--;

    // ポテンシャルMAP計算
    make_potential( goal_x, goal_y, mode );
    next_motion = search_adachi();  // 次の行動予測

