SunSunSun-23413011/RX231_Mouse3/RX231_Mouse3.c
    if( zerozero == 1 ){
      while( STEP < HALF_STEP );
      step_l = 0;
      step_r = 0;
      STEP = 0;
      zerozero = 0;
    }

    // 旋回前の進入距離をスラローム向けに調整
    if( prev_motion == 1 || prev_motion == 3 ){
      while( STEP < GO_STEP / 2 );
    }else if( (next_motion == 1 || next_motion == 3) && spd >= 600 ){
      control_mode = 0;
      while( STEP < 200 );
    }else{
      while( STEP < GO_STEP / 2 && F_SEN < F_LIM_SLA );
    }

    if( mode == S_MODE ) make_map_data();

    motion = search_adachi();
    if( pos_x == goal_x && pos_y == goal_y )
      motion = 4;

    switch( motion ){
      case  0 :
        while( STEP < GO_STEP );
        head_change = 0;
        break;
      case  1 :
        com_slalom_turn( 0 );
        head_change = 1;
        break;
      case  2 :
        while( STEP < GO_STEP - speed_now * speed_now / 300 && F_SEN < F_REF );
        speed = 1;
        while( STEP < GO_STEP && F_SEN < F_REF );
        kbat_lf_turn();
        head_change = 2;
        break;
      case  3 :
        com_slalom_turn( 1 );
        head_change = 3;
        break;
      case  4 :
        while( STEP < GO_STEP - speed_now * speed_now / 300 && F_SEN < F_REF );
        speed = 1;
        while( STEP < GO_STEP && F_SEN < F_REF );
        goal_kbat_turn();
        com_stop();
        head_change = 2;
        head = ( head + head_change ) & 0x03;
        block_count = 0;
        for( y = 0 ; y < 16 ; y++ ){
          for( x = 0 ; x < 16 ; x++ ){
            if( ( map[ x ][ y ] & 0xf0 ) == 0xf0 )
              block_count++;
          }
        }
        return;
      default :
        com_stop();
        head_change = 0;
        head = ( head + head_change ) & 0x03;
        return;
    }

    prev_motion = motion;
    head = ( head + head_change ) & 0x03;
  }
}


//-------------------------------------------------------------------------
//  直進モジュール (N区間前進)
//-------------------------------------------------------------------------
void com_go( int n ){
  control_mode = 1;                       // 直線走行用姿勢制御
  step_l = 0; step_r = 0;               // モータステップ数カウンタクリア
  STEP = 0;                               // 距離カウンタクリア
  rdir = 0; ldir = 0;                     // 回転方向を直進

  // 加速モード
  speed = 200;        // 目標速度設定
  while( speed > speed_now );                   // 目標速度になるまで加速
  // 定速モード
  speed = speed_now;  // 加速後の速度
  while( STEP < GO_STEP * n - speed_now * 2 );  // 減速ステップ数を残して定速移動
                                                // 全体ステップ数-減速用ステップ数
  // 減速モード
  speed = 1;          // 最低速度設定
  while( STEP < GO_STEP * n );                  // 残りのステップ数で減速
}

//-------------------------------------------------------------------------
//  直進モジュール (四半区間前進)
//-------------------------------------------------------------------------
void com_go_half( int n ){
  control_mode = 0;
  STEP = 0;
  rdir = 0; ldir = 0;
  speed = 100;
  while( speed > speed_now );
  speed = speed_now;
  while( STEP < HALF_STEP * n - speed_now * 2 );
  speed = 1;
  while( STEP < HALF_STEP * n );
}

//-------------------------------------------------------------------------
//  停止モジュール
//-------------------------------------------------------------------------
void com_stop( void ){
  control_mode = 0;           // 姿勢制御無し
  rdir = 0; ldir = 0;         // モータの回転方向を前進
  step_l = 0; step_r = 0; // モータステップ数カウンタをリセット
  STEP = 0;                   // 距離カウンタをリセット
  speed = 0;  speed_now = 0;  // モータの制御用の変数をリセット
  pause(100);                 // 0.1秒モータを停止
}

//-------------------------------------------------------------------------
//  後進モジュール
//-------------------------------------------------------------------------
void com_back( int n ){
  short BACK_STEP = GO_STEP / 2; // 後進ステップ数設定
  control_mode = 0;
  rdir = 1; ldir = 1;           // 回転方向を後進
  STEP = 0;                     // 距離カウンタリセット
  speed = 100;        // 目標速度設定
  while( speed > speed_now );                   // 目標速度になるまで加速
  speed = speed_now;  // 加速後の速度
  while( STEP < BACK_STEP * n - speed_now * 2 );  // 減速ステップ数を残して定速移動
                                                // 全体ステップ数-減速用ステップ数
  // 減速モード
  speed = 1;          // 最低速度設定
  while( STEP < BACK_STEP * n );                  // 残りのステップ数で減速
}

//-------------------------------------------------------------------------
//  旋回モジュール (0:R90 1:L90 2:R180 3:L180)
//-------------------------------------------------------------------------
void com_turn( int t_mode ){
  short T_STEP;

  com_stop();                                             // 停止
  control_mode = 0;                                       // 姿勢制御なし
  if     ( t_mode == 0 ) { T_STEP = TURN_STEP; rdir = 1; ldir = 0; } // 右９０度
  else if( t_mode == 1 ) { T_STEP = TURN_STEP; rdir = 0; ldir = 1; } // 左９０度
  else if( t_mode == 2 ) { T_STEP = TURN_STEP * 2; rdir = 1; ldir = 0; } // 右反転
  else if( t_mode == 3 ) { T_STEP = TURN_STEP * 2; rdir = 0; ldir = 1; } // 左反転

  // 加速モード
  speed = 100;        // 目標速度設定
  while( speed > speed_now );                   // 目標速度になるまで加速
  // 定速モード
  speed = speed_now;  // 加速後の速度
  while( STEP < T_STEP - speed_now * 2 );       // 減速ステップ数を残して定速移動
                                                // 全体ステップ数-減速用ステップ数
  // 減速モード
  speed = 1;          // 最低速度設定
  while( STEP < T_STEP );                       // 残りのステップ数で減速
}

//-------------------------------------------------------------------------
//  スラロームモジュール (0:R90 1:L90 2:R180 3:L180) 
//-------------------------------------------------------------------------
void com_slalom_turn( int t_mode ){
  control_mode = 0;                       // 姿勢制御無し
  step_r = 0;                               //右ステップ数をリセット
  step_l = 0;                               //左ステップ数をリセット
  STEP = 0;                               // 距離カウンタクリア
  rdir = 0; ldir = 0;                     // 回転方向を直進
  if( t_mode == 0 ) {
    speed = Global_Speed;
    while( speed > speed_now && F_SEN < F_LIM_SLA );
    speed = speed_now;
    while( (step_r < SLALOM_STEP_FORWARD) && (F_SEN < F_LIM_SLA || R_SEN > R_LIM) );
    control_mode = 2;           // スラローム用姿勢制御
    step_r = 0;                               //右ステップ数をリセット
    step_l = 0;                               //左ステップ数をリセット
    STEP = 0;                               // 距離カウンタクリア
    while( step_l < SLALOM_STEP_OUT );
  }
  else if( t_mode == 1 ) {
    speed = Global_Speed;
    while( speed > speed_now && F_SEN < F_LIM_SLA );
    speed = speed_now;
    while( (step_l < SLALOM_STEP_FORWARD) && (F_SEN < F_LIM_SLA || L_SEN > L_LIM) );
    control_mode = 3;           // スラローム用姿勢制御
    step_r = 0;                               //右ステップ数をリセット
    step_l = 0;                               //左ステップ数をリセット
    STEP = 0;                               // 距離カウンタクリア
    while( step_r < SLALOM_STEP_OUT );
  }
  //else if( t_mode == 2 ) { T_STEP *= 2; rdir = 1; ldir = 0; }
  //else if( t_mode == 3 ) { T_STEP *= 2; rdir = 0; ldir = 1; }
}

//-------------------------------------------------------------------------
//  後ろ壁当て
//-------------------------------------------------------------------------
void back_wall_set( void ){
  control_mode = 0;           // 姿勢制御無し
  com_stop();
  com_back( 1 );
  com_stop();
}

//-------------------------------------------------------------------------
//  ゴール壁当て
//-------------------------------------------------------------------------
void goal_kbat_turn( void ){
  if( F_SEN > F_LIM ){
    if( R_SEN > R_LIM){
      com_stop();
      com_turn( 1 );
      com_stop();
      com_back( 1 );
      com_stop();
      com_go_half( 1 );
      com_stop();
      com_turn( 1 );
      com_stop();
      com_back( 1 );
      com_stop();
      zerozero = 1;
    }else if( L_SEN > L_LIM ){
      com_stop();
      com_turn( 0 );
      com_stop();
      com_back( 1 );
      com_stop();
      com_go_half( 1 );
      com_stop();
      com_turn( 0 );
      com_stop();
      com_back( 1 );
      com_stop();
      zerozero = 1;
    }else{
      com_turn( 3 );
      back_wall_set();
      zerozero = 1;
    }
  }else{
    if( R_SEN > R_LIM ){
      com_stop();
      com_turn( 1 );
      com_stop();
      com_back( 1 );
      com_stop();
      com_go_half( 1 );
      com_stop();
      com_turn( 1 );
    }else if( L_SEN > L_LIM ){
      com_stop();
      com_turn( 0 );
      com_stop();
      com_back( 1 );
      com_stop();
      com_go_half( 1 );
      com_stop();
      com_turn( 0 );
    }else{
      com_turn( 3 );
    }
  }
  com_stop();
}


//-------------------------------------------------------------------------
//  壁当てターン
//-------------------------------------------------------------------------
void kbat_lf_turn( void ){
  int kabe;
  kabe = search_left_hand();
  switch( kabe ){
    case 0:
    case 1:
      com_stop();
      com_turn( 0 );
      com_stop();
      com_back( 1 );
      com_stop();
      com_go_half( 1 );
      com_stop();
      com_turn( 0 );
      break;
    case 2:
      com_stop();
      com_turn( 0 );
      com_stop();
      com_back( 1 );
      com_stop();
      com_go_half( 1 );
      com_stop();
      com_turn( 0 );
      com_stop();
      com_back( 1 );
      com_stop();
      zerozero = 1;
      break;
    default :
      if( F_SEN > F_LIM ){
        com_turn( 2 );
        com_stop();
        com_back( 1 );
        com_stop();
        zerozero = 1;
      }else{
        com_turn( 2 );
      }
  }
}

//-------------------------------------------------------------------------
//  時報音
//-------------------------------------------------------------------------
SOUND_T Chime_1[]={
{RA3_, T16_}, /* ラ (A7) */
{STP_, T00_},
};

//-------------------------------------------------------------------------
//  起動音
//-------------------------------------------------------------------------
SOUND_T Chime_2[]={
{RE2_, T16_}, /* レ (D6) */
{SO2_, T16_}, /* ソ (A6) */
{STP_, T00_},
};

//-------------------------------------------------------------------------
//  カウントダウン
//-------------------------------------------------------------------------
SOUND_T Countdown[]={
{RA1_, T04_}, /* ラ (A5) */
{RST_, T08_}, /* 休符 */
{RA1_, T04_}, /* ラ (A5) */
{RST_, T08_}, /* 休符 */
{RA1_, T04_}, /* ラ (A5) */
{RST_, T08_}, /* 休符 */
{RA2_, T02_}, /* ラ (A6) */
{STP_, T00_},
};

//-------------------------------------------------------------------------
// ゴール
//-------------------------------------------------------------------------
SOUND_T Goal[]={
{SO2_, T32_}, /* ソ (G6) */
{RST_, T32_}, /* 休符 */
{SO2_, T32_}, /* ソ (G6) */
{RST_, TIT_}, /* 休符 */
{DO3_, T16_}, /* ド (C7) */
{STP_, T00_},
};
//-------------------------------------------------------------------------
//  ビープ音 
//-------------------------------------------------------------------------
SOUND_T Melody_1[]={
{DO3_, T16_},
{RST_, T32_},
{DO3_, T16_},
{RST_, T32_},
{DO3_, T16_},
{RST_, T32_},
{DO3_, T16_},
{RST_, T32_},
{DO3_, T16_},
{RST_, T32_},
{DO3_, T16_},
{RST_, T32_},
{RPT_, T00_},
};
 
//-------------------------------------------------------------------------
//  ロンドン橋
//-------------------------------------------------------------------------
SOUND_T Melody_2[]={
{SO1_, T08_ + (T08_/2)},
{RA1_, T16_},
{SO1_, T08_},
{FA1_, T08_},
{MI1_, T08_},
{FA1_, T08_},
{SO1_, T04_},
{RE1_, T08_},
{MI1_, T08_},
{FA1_, T04_},
{MI1_, T08_},
{FA1_, T08_},
{SO1_, T04_},
{SO1_, T08_ + (T08_/2)},
{RA1_, T16_},
{SO1_, T08_},
{FA1_, T08_},
{MI1_, T08_},
{FA1_, T08_},
{SO1_, T04_},
{RE1_, T04_},
{SO1_, T04_},
{MI1_, T08_},
{DO1_, T04_ + (T04_/2)},

{SO1_, T08_ + (T08_/2)},
{RA1_, T16_},
{SO1_, T08_},
{FA1_, T08_},
{MI1_, T08_},
{FA1_, T08_},
{SO1_, T04_},
{RE1_, T08_},
{MI1_, T08_},
{FA1_, T04_},
{MI1_, T08_},
{FA1_, T08_},
{SO1_, T04_},
{SO1_, T08_ + (T08_/2)},
{RA1_, T16_},
{SO1_, T08_},
{FA1_, T08_},
{MI1_, T08_},
{FA1_, T08_},
{SO1_, T04_},
{RE1_, T04_},
{SO1_, T04_},
{MI1_, T08_},
{DO1_, T04_ + (T04_/2)},
{RPT_, T00_},
};

//-------------------------------------------------------------------------
//  サウンド発音開始
//-------------------------------------------------------------------------
/* 引数 : nMelodyNum = サウンド・メロディ番号（1,2,99） */
/* 戻値 : Start_Sound() == TRUE : サウンド発生開始 */
/* : == FALSE : サウンド発生なし */

BOOL Start_Sound(int nMelodyNum){
/* サウンド出力中なら停止する */
if(SoundStatus.BIT.SOUND_ON == 1){
  Stop_Sound();
  }
  if(nMelodyNum == 1){
  st_pSound = &Melody_1[0]; /* ビープ音 */
  }
  else if(nMelodyNum == 2){
  st_pSound = &Melody_2[0]; /* ロンドン橋 */
  }else if(nMelodyNum == 3){
  st_pSound = &ccnt2[0]; /* ココナッツモール */
  }else if(nMelodyNum == 96){
  st_pSound = &Goal[0]; /* ゴール */
  }else if(nMelodyNum == 97){
  st_pSound = &Countdown[0]; /* カウントダウン */
  }else if(nMelodyNum == 98){
  st_pSound = &Chime_2[0]; /* 起動音 */
  }else if(nMelodyNum == 99){
  st_pSound = &Chime_1[0]; /* 時報音 */
  }
  else{
  return FALSE;
  }
  st_nSoundRPos = 0;
  /* 最初から終端マークまたは繰り返しマークだったら何もしない */
  if((st_pSound[st_nSoundRPos].NOTES == RPT_) || (st_pSound[st_nSoundRPos].NOTES == STP_)){
  return FALSE;
  }
  /* サウンド出力中を示す */
  SoundStatus.BIT.SOUND_ON = 1;
  SoundStatus.BIT.SOUND_SP = 0;
  SoundStatus.BIT.SOUND_IT = 0;
  /* タイマリードライト許可レジスタ（MTU3,MTU4に必要） */
  // MTU.TRWER.BYTE = 0x01;
  /* 音の時間（長さ）をセット */
  MTU1.TCNT = 0x0000;
  MTU1.TGRA = T16_; /* 0.125秒後に発音開始 */
  /* MTU0,MTU1カウントスタート */
  R_Config_MTU0_Start();
  R_Config_MTU1_Start();
  /* MTU1コンペアマッチA割り込み許可 */
  IEN(MTU1, TGIA1) = 1;
 
