SunSunSun-23413011/RX231_Mouse3/RX231_Mouse3.c
 return TRUE;
 }
 
//-------------------------------------------------------------------------
//  サウンド停止
//-------------------------------------------------------------------------
void Stop_Sound(void){
 /* MTU1コンペアマッチA割り込み禁止 */
  IEN(MTU1, TGIA1) = 0;
  /* MTIOC0B端子を出力禁止にする（Hi-Zになる） */
  MTU0.TIORH.BIT.IOB = 0;
  /* MTU0,MTU1カウント停止 */
  R_Config_MTU0_Stop();
  R_Config_MTU1_Stop();
  /* 発音停止中を示す */
  SoundStatus.BIT.SOUND_ON = 0;
  SoundStatus.BIT.SOUND_SP = 0;
}

//-------------------------------------------------------------------------
//  加速テーブル取得
//-------------------------------------------------------------------------
u16 AccTableGet(u16 index){
    u32 v;

    if (index >= ACC_TABLE_SIZE) {
        index = (u16)(ACC_TABLE_SIZE - 1u);
    }

    v = (u32)ACC_TABLE_BASE + (u32)index * (u32)ACC_TABLE_STEP;
    return (u16)v; /* 300..8296なのでu16に収まる */
}

static	void	flash_dm_callback(void*event){
	g_flash_dm_last=(e_flash_dm_status_t)event;
	g_flash_dm_done=1;
}

static	e_flash_dm_status_t	flash_dm_wait(void){
	while(!g_flash_dm_done){}
	g_flash_dm_done=0;
	return	g_flash_dm_last;
}

static	int	flash_dm_format(void){
	e_flash_dm_status_t	st;
	g_flash_dm_done=0;
	st=R_FLASH_DM_Format();
	if(st==FLASH_DM_ACCEPT){
		st=flash_dm_wait();
	}
	if(st==FLASH_DM_FINISH_FORMAT){
		return	1;
	}
	return	0;
}

static	int	flash_dm_erase(void){
	e_flash_dm_status_t	st;
	g_flash_dm_done=0;
	st=R_FLASH_DM_Erase();
	if(st==FLASH_DM_NO_INVALID_BLOCK){
		return	1;
	}
	if(st==FLASH_DM_ACCEPT){
		st=flash_dm_wait();
	}
	if(st==FLASH_DM_FINISH_ERASE){
		return	1;
	}
	return	0;
}

static	int	flash_dm_reclaim(void){
	e_flash_dm_status_t	st;
#if(FLASH_TYPE == FLASH_TYPE_1)
	g_flash_dm_done=0;
	st=R_FLASH_DM_Reclaim();
	if(st==FLASH_DM_ERR_REQUEST_ERASE){
		if(!flash_dm_erase()){
			return	0;
		}
		g_flash_dm_done=0;
		st=R_FLASH_DM_Reclaim();
	}
	if(st==FLASH_DM_ACCEPT){
		st=flash_dm_wait();
	}
	if((st==FLASH_DM_FINISH_RECLAIM)||(st==FLASH_DM_SUCCESS)){
		return	1;
	}
	return	0;
#else
	(void)st;
	return	flash_dm_erase();
#endif
}

//-------------------------------------------------------------------------
//  データフラッシュ初期化 (周辺クロックをFCUに通知する関数)   1/31
//-------------------------------------------------------------------------
static	int	flash_dm_init_once(void){
	e_flash_dm_status_t	st;
	if(g_flash_dm_ready){
		return	1;
	}
	st=R_FLASH_DM_Open(g_flash_dm_work,flash_dm_callback);
	if(st!=FLASH_DM_SUCCESS){
		return	0;
	}
	for(;;){
		st=R_FLASH_DM_Init();
		if(st==FLASH_DM_SUCCESS){
			g_flash_dm_ready=1;
			return	1;
		}
		if(st==FLASH_DM_SUCCESS_REQUEST_ERASE){
			if(!flash_dm_erase()){
				return	0;
			}
			continue;
		}
		if(st==FLASH_DM_ERR_REQUEST_FORMAT){
			if(!flash_dm_format()){
				return	0;
			}
			continue;
		}
		if(st==FLASH_DM_ERR_BUSY){
			continue;
		}
		if(st==FLASH_DM_ERR_REQUEST_INIT){
			continue;
		}
		return	0;
	}
}

//-------------------------------------------------------------------------
//  データフラッシュメモリ1ブロック(128byte)書込み  
//  書込みブロック先頭:block 書込みデータ:data
//-------------------------------------------------------------------------
static	int	flash_dm_write(uint8_t	data_no,const	uint8_t*data){
	st_flash_dm_info_t	info;
	e_flash_dm_status_t	st;
	info.data_no=data_no;
	info.p_data=(uint8_t*)data;
	for(;;){
		g_flash_dm_done=0;
		st=R_FLASH_DM_Write(&info);
		if(st==FLASH_DM_ERR_REQUEST_RECLAIM){
			if(!flash_dm_reclaim()){
				return	0;
			}
			continue;
		}
		if(st==FLASH_DM_ERR_REQUEST_ERASE){
			if(!flash_dm_erase()){
				return	0;
			}
			continue;
		}
		if(st==FLASH_DM_ERR_REQUEST_INIT){
			if(!flash_dm_init_once()){
				return	0;
			}
			continue;
		}
		if(st==FLASH_DM_ERR_BUSY){
			continue;
		}
		if(st==FLASH_DM_ACCEPT){
			st=flash_dm_wait();
		}
		if((st==FLASH_DM_FINISH_WRITE)||(st==FLASH_DM_SUCCESS)){
			return	1;
		}
		return	0;
	}
}

//-------------------------------------------------------------------------
// MAPデータをDataFlashから読出し
// MAPデータの見方:map[ pos_x ][ pos_y ] 何個目のMAPか:no
//-------------------------------------------------------------------------
static	int	flash_dm_read(uint8_t	data_no,uint8_t*data){
	st_flash_dm_info_t	info;
	e_flash_dm_status_t	st;
	info.data_no=data_no;
	info.p_data=data;
	st=R_FLASH_DM_Read(&info);
	if(st==FLASH_DM_ERR_REQUEST_INIT){
		if(!flash_dm_init_once()){
			return	0;
		}
		st=R_FLASH_DM_Read(&info);
	}
	if(st==FLASH_DM_SUCCESS){
		return	1;
	}
	return	0;
}

//-------------------------------------------------------------------------
// MAPデータをDataFlashへ書込み   
// MAPデータの見方:map[ pos_x ][ pos_y ] 何個目のMAPにするか:no
//-------------------------------------------------------------------------
int	map_writeDF(short	no){
	uint8_t	buf[MAP_DATA_BYTES];
	uint8_t	x;
	uint8_t	y;
	uint16_t	idx;
	if((no<0)||(no>=(short)MAP_DATA_SLOTS)){
		return	0;
	}
	if(!flash_dm_init_once()){
		return	0;
	}
	for(y=0;y<16;y++){
		for(x=0;x<16;x++){
			idx=(uint16_t)y*16u+(uint16_t)x;
			buf[idx]=map[x][y];
		}
	}
	return	flash_dm_write((uint8_t)no,buf);
}

void	map_DFread(short	no){
	uint8_t	buf[MAP_DATA_BYTES];
	uint8_t	x;
	uint8_t	y;
	uint16_t	idx;
	if((no<0)||(no>=(short)MAP_DATA_SLOTS)){
		return;
	}
	if(!flash_dm_init_once()){
		return;
	}
	if(!flash_dm_read((uint8_t)no,buf)){
		return;
	}
	for(y=0;y<16;y++){
		for(x=0;x<16;x++){
			idx=(uint16_t)y*16u+(uint16_t)x;
			map[x][y]=buf[idx];
		}
	}
}

//-------------------------------------------------------------------------
//  壁のセンシング
//-------------------------------------------------------------------------
int goal_find_index( int gx, int gy ){
  int i;
  for(i=0;i<GOAL_NUM;i++){
    if(goals[i][0]==gx){
      if(goals[i][1]==gy){
        return i;
      }
    }
  }
  return -1;
}

int goal_writeDF( void ){
  uint8_t buf[1];
  int goal_idx;
  goal_idx = goal_find_index(goal[0], goal[1]);
  if(goal_idx < 0){
    return 0;
  }
  if(goal_idx > (int)GOAL_DATA_INDEX_MASK){
    return 0;
  }
  if(!flash_dm_init_once()){
    return 0;
  }
  buf[0] = (uint8_t)(GOAL_DATA_MAGIC + (uint8_t)goal_idx);
  return flash_dm_write((uint8_t)GOAL_DATA_NO, buf);
}

int goal_DFread( int *gx, int *gy ){
  uint8_t buf[1];
  int goal_idx;
  if(gx==0){
    return 0;
  }
  if(gy==0){
    return 0;
  }
  if(!flash_dm_init_once()){
    return 0;
  }
  if(!flash_dm_read((uint8_t)GOAL_DATA_NO, buf)){
    return 0;
  }
  if(((buf[0]/32u)*32u) != GOAL_DATA_MAGIC){
    return 0;
  }
  goal_idx = (int)(buf[0] - ((buf[0]/32u)*32u));
  if(goal_idx >= GOAL_NUM){
    return 0;
  }
  *gx = goals[goal_idx][0];
  *gy = goals[goal_idx][1];
  return 1;
}

int get_wall_data( void ){
  short wall;

  // センサデータを入力，閾値と比較して壁の有無を判定
  wall = 0;
  if( F_SEN > F_LIM )  wall |= 0x01; // 前壁あり
  if( R_SEN > R_LIM )  wall |= 0x02; // 右壁あり
  if( L_SEN > L_LIM )  wall |= 0x08; // 左壁あり
  // 後壁はあるわけないので見ない

  return( wall );
}

//-------------------------------------------------------------------------
// MAPデータの見方
// 探索記録 bit 7 6 5 4 = 西 南 東 北 / 値 = 1:既探索 0:未探索
// 壁情報   bit 3 2 1 0 = 西 南 東 北 / 値 = 1:壁有り 0:壁無し
//-------------------------------------------------------------------------

//-------------------------------------------------------------------------
//  MAPデータ初期化
//-------------------------------------------------------------------------
void clear_map( void ){
  int x, y;
  // 全ての区間を壁なし＆未探索に初期化
  for( y = 0 ; y < 16 ; y++ )
    for( x = 0 ; x < 16 ; x++ )
      map[ x ][ y ] = 0x00;

