SunSunSun-23413011/RX231_Mouse3/RX231_Mouse3.c
  // 西側の外壁（x=0，y=0～15）を上書き
  for( y = 0 ; y < 16 ; y++ )
    map[ 0 ][ y ] = 0x88;  // 西のみ既探索(8)＆西のみ壁あり(8)
  // 南側の外壁（x=0～15，y=0）を上書き
  for( x = 0 ; x < 16 ; x++ )
    map[ x ][ 0 ] = 0x44;  // 南のみ既探索(4)＆南のみ壁あり(4)
  // 東側の外壁（x=15，y=0～15）を上書き
  for( y = 0 ; y < 16 ; y++ )
    map[ 15 ][ y ] = 0x22; // 東のみ既探索(2)＆東のみ壁あり(2)
  // 北側の外壁（x=0～15，y=15）を上書き
  for( x = 0 ; x < 16 ; x++ )
    map[ x ][ 15 ] = 0x11; // 北のみ既探索(1)＆北のみ壁あり(1)

  // スタート区間（x=0，y=0）の上書き
  map[ 0 ][ 0 ] = 0xfe;  // 西南東北既探索(8+4+2+1=f)＆西南東壁あり(8+4+2=e)
  // スタート区間1つ右（x=1，y=0）の上書き
  map[ 1 ][ 0 ] = 0xcc;  // 西南既探索(8+4=c)＆西南壁あり(8+4=c)

  // 左上角（x=0，y=15）の上書き
  map[ 0 ][ 15 ] = 0x99; // 西北既探索(8+1=9)＆西北壁あり(8+1=9)
  // 右下角（x=15，y=0）の上書き
  map[ 15 ][ 0 ] = 0x66; // 南東既探索(4+2=6)＆南東壁あり(4+2=6)
  // 右上角（x=15，y=15）の上書き
  map[ 15 ][ 15 ] = 0x33;// 東北既探索(2+1=3)＆東北壁あり(2+1=3)
}

//-------------------------------------------------------------------------
//  センサ情報から探索記録＆壁情報をMAPデータに更新
//-------------------------------------------------------------------------
void make_map_data( void ){
  uchar wall;

  // 壁情報取得
  wall = get_wall_data();
  // 方向合わせ処理のために上位4bitに下位4bitの壁情報をコピー
  wall = ( wall & 0x0f ) | ( wall << 4 );
  // マウスの進行方向にあわせて壁データを加工
  if     ( head == 1 ) wall = wall >> 3; // 北が前の情報を東が前に加工
  else if( head == 2 ) wall = wall >> 2; // 北が前の情報を南が前に加工
  else if( head == 3 ) wall = wall >> 1; // 北が前の情報を西が前に加工
  // 西南東北を探索済みにする
  wall |= 0xf0;
  // 壁情報をMAPデータに上書き
  map[ pos_x ][ pos_y ] = wall;

  // 西南東北の隣区画のMAPデータを上書き

  // 現在区画の東壁情報を1つ右区画の西壁情報として上書きする処理
  // ここだけ詳細に説明．残り3つ（下，左，上）はまとめて記述
  if( pos_x != 15 ){  // 一番東側の区画の時以外
    // 右区画の西側情報（探索記録＆壁情報）を消去
    map[ pos_x + 1 ][ pos_y ] &= 0x77;
    // 右区画の西側探索記録を既探索とする
    map[ pos_x + 1 ][ pos_y ] |= 0x80;
    // 現在区画の東側情報を西側情報に変換して右区画の西側壁情報に上書き
    map[ pos_x + 1 ][ pos_y ] |= ( map[ pos_x ][ pos_y ] << 2 ) & 0x08;
  }
  
  // 現在区画の南壁情報を1つ下区画の北壁情報として上書きする処理
  if(pos_y!=0) map[pos_x][pos_y-1]=(map[pos_x][pos_y-1]&0xee)|0x10|((wall>>2)&0x01);
  // 現在区画の西壁情報を1つ左区画の東壁情報として上書きする処理
  if(pos_x!=0) map[pos_x-1][pos_y]=(map[pos_x-1][pos_y]&0xdd)|0x20|((wall>>2)&0x02);
  // 現在区画の北壁情報を1つ上区画の南壁情報として上書きする処理
  if(pos_y!=15)map[pos_x][pos_y+1]=(map[pos_x][pos_y+1]&0xbb)|0x40|((wall<<2)&0x04);
}

//-------------------------------------------------------------------------
//  等高線（ポテンシャル場）作成
//-------------------------------------------------------------------------
void make_potential( int gx, int gy, int mode )
{
  uchar check_num, flg;
  uchar x,y;

  // ポテンシャルMAP初期化(全て最大値255にする)
  for( y = 0 ; y < 16 ; y++ )
    for( x = 0 ; x < 16 ; x++ )
      p_map[ x ][ y ] = 255;

  // ゴール座標にポテンシャル0を書き込む
  p_map[ gx ][ gy ] = 0;

  check_num = 0;
  do{
    flg = 0;  // 変更フラグ初期化
    for( y = 0 ; y < 16 ; y++ ){
      for( x = 0 ; x < 16 ; x++ ){
        if( p_map[ x ][ y ] == check_num ){  // 今回対象区画とするポテンシャル
          if( mode == S_MODE ){

            // 探索走行(Search Mode)
            // 北側の壁がない場合：北側のポテンシャルを対象区画のポテンシャルより+1
            if((( map[ x ][ y ] & 0x01 ) == 0 ) && ( y != 15 )){
              if( p_map[ x ][ y + 1 ] == 255 ){// まだポテンシャルを書いてなければ
                p_map[ x ][ y + 1 ] = check_num + 1;
                flg = 1;  // 変更したのでフラグON
              }
            }
            // 東側の壁も同様に処理
            if((( map[ x ][ y ] & 0x02 ) == 0 ) && ( x != 15 ))
              if(p_map[x+1][y]==255){p_map[x+1][y]=check_num+1;flg=1;}
            // 南側の壁も同様に処理
            if((( map[ x ][ y ] & 0x04 ) == 0 ) && ( y != 0 ))
              if(p_map[x][y-1]==255){p_map[x][y-1]=check_num+1;flg=1;}
            // 西側の壁も同様に処理
            if((( map[ x ][ y ] & 0x08 ) == 0 ) && ( x != 0 ))
              if(p_map[x-1][y]==255){p_map[x-1][y]=check_num+1;flg=1;}

          }else{

           // 二次走行(Try Mode)
           // 北側が壁なし＆既探索の場合(壁なしでも未探索はポテンシャル255のまま)
            // 北側のポテンシャルを対象区画のポテンシャルより+1
            if((( map[ x ][ y ] & 0x11 ) == 0x10 ) && ( y != 15 ) && (( map[ x ][ y + 1 ] & 0xf0 ) == 0xf0 )){
              if( p_map[ x ][ y + 1 ] == 255 ){// まだポテンシャルを書いてなければ
                p_map[ x ][ y + 1 ] = check_num + 1;
                flg = 1;  // 変更したのでフラグON
              }
            }
            // 東側の壁も同様に処理
            if((( map[ x ][ y ] & 0x22 ) == 0x20 ) && ( x != 15 ) && (( map[ x + 1 ][ y ] & 0xf0 ) == 0xf0 ))
              if(p_map[x+1][y]==255){p_map[x+1][y]=check_num+1;flg=1;}
            // 南側の壁も同様に処理
            if((( map[ x ][ y ] & 0x44 ) == 0x40 ) && ( y != 0 ) && (( map[ x ][ y - 1 ] & 0xf0 ) == 0xf0 ))
              if(p_map[x][y-1]==255){p_map[x][y-1]=check_num+1;flg=1;}
            // 西側の壁も同様に処理
            if((( map[ x ][ y ] & 0x88 ) == 0x80 ) && ( x != 0 ) && (( map[ x - 1 ][ y ] & 0xf0 ) == 0xf0 ))
              if(p_map[x-1][y]==255){p_map[x-1][y]=check_num+1;flg=1;}

          }
        }
      }
    }
    check_num++;      // 次のループのために対象ポテンシャルを+1
  }while( flg != 0 ); // 今回のループで変更箇所が無ければ作成完了
}

//-------------------------------------------------------------------------
//  探索：左手法
//-------------------------------------------------------------------------
int search_left_hand( void ){
  short wall_data, motion;

  wall_data = get_wall_data();  // 壁情報取得

  // 壁情報を用いて次の行動を決定（左手法）
    // motion = 0:直進 / 1:右折 / 2:反転 / 3:左折 / 4:反転停止
    switch( wall_data ){
      case  0x00  : motion = 3; break;  // 左に壁なし:左折
      case  0x01  : motion = 3; break;  // 左に壁なし:左折
      case  0x02  : motion = 3; break;  // 左に壁なし:左折
      case  0x03  : motion = 3; break;  // 左に壁なし:左折
      case  0x04  : motion = 3; break;  // 左に壁なし:左折
      case  0x05  : motion = 3; break;  // 左に壁なし:左折
      case  0x06  : motion = 3; break;  // 左に壁なし:左折
      case  0x07  : motion = 3; break;  // 左に壁なし:左折
      case  0x08  : motion = 0; break;  // 左に壁,前に壁なし:直進
      case  0x09  : motion = 1; break;  // 左に壁,前に壁,右に壁なし:右折
      case  0x0a  : motion = 0; break;  // 左に壁,前に壁なし:直進
      case  0x0b  : motion = 2; break;  // 左に壁,前に壁,右に壁:反転
      default     : motion = 4; break;  // 後ろに壁:あり得ないので停止
  }
  return( motion );
}

//-------------------------------------------------------------------------
//  探索：拡張左手法
//-------------------------------------------------------------------------
int search_ex_left_hand( void ){
  short wall_data, motion, val, min_val;

