SunSunSun-23413011/RX231_Mouse3/RX231_Mouse3.c
  wall_data = map[ pos_x ][ pos_y ];  // 現在区画の壁情報取得

  min_val = 8;  // 計算される優先度の最大値+1を初期値に設定

  // 北方向の優先度の計算
  if(( wall_data & 0x01 ) == 0 ){     // 北方向に壁が無いとき
    // 1.方向による優先度の計算
    // マウスから見たこの壁の方向と優先度 左:0, 前:1，右:2，後:3
    // head=0（マウスの頭が北）の場合は優先度1（北は前）
    // head=1（マウスの頭が東）の場合は優先度0（北は左）
    // head=2（マウスの頭が南）の場合は優先度3（北は後）
    // head=3（マウスの頭が西）の場合は優先度2（北は右）
    val = (( 3 - head ) + 2 ) & 0x03;

    // 2.未探索／既探索による優先度の計算
    // 未探索:0，既探索:+4
    if(( map[ pos_x ][ pos_y + 1 ] & 0xf0 ) == 0xf0 ) val += 4;

    // 3.この壁が優先かどうかを判断
    // ここまでの計算で以下の優先度のどれかになる
    // 0:北方向がマウスの左側で未探索
    // 1:北方向がマウスの前側で未探索
    // 2:北方向がマウスの右側で未探索
    // 3:北方向がマウスの後側で未探索（※有り得ない）
    // 4:北方向がマウスの左側で既探索
    // 5:北方向がマウスの前側で既探索
    // 6:北方向がマウスの右側で既探索
    // 7:北方向がマウスの後側で既探索

    if( val < min_val ){
      min_val = val;  // 最小値の更新
      motion = 0;     // 移動すべき方向を北に設定
    }
  }

  // 東方向の優先度の計算
  if(( wall_data & 0x02 ) == 0 ){     // 東方向に壁が無いとき
    val = (( 3 - head ) + 3 ) & 0x03;
    if(( map[ pos_x + 1 ][ pos_y ] & 0xf0 ) == 0xf0 ) val += 4;
    if( val < min_val ){
      min_val = val;  // 最小値の更新
      motion = 1;     // 移動すべき方向を東に設定
    }
  }

  // 南方向の優先度の計算
  if(( wall_data & 0x04 ) == 0 ){     // 南方向に壁が無いとき
    val = (( 3 - head ) + 0 ) & 0x03;
    if(( map[ pos_x ][ pos_y - 1 ] & 0xf0 ) == 0xf0 ) val += 4;
    if( val < min_val ){
      min_val = val;  // 最小値の更新
      motion = 2;     // 移動すべき方向を南に設定
    }
  }

  // 西方向の優先度の計算
  if(( wall_data & 0x08 ) == 0 ){     // 西方向に壁が無いとき
    val = (( 3 - head ) + 1 ) & 0x03;
    if(( map[ pos_x - 1 ][ pos_y ] & 0xf0 ) == 0xf0 ) val += 4;
    if( val < min_val ){
      min_val = val;  // 最小値の更新
      motion = 3;     // 移動すべき方向を西に設定
    }
  }

  // 移動すべき方向から行動を決定
  // (目標方向-現在方向)を2進数下2桁でマスク
  // 引き算の結果が負の場合は2の補数でマスクされる
  // 11 -> 10 -> 01 -> 00 -> (-1)=11 -> (-2)=10 ...
  motion = ( motion - head ) & 0x03;

  return( motion );
}

//-------------------------------------------------------------------------
//  探索：足立法
//-------------------------------------------------------------------------
int search_adachi( void ){
  uchar wall_data, motion;
  short val, min_val;

  // 現在区画の壁情報取得
  wall_data = map[ pos_x ][ pos_y ];

  // 計算される優先度の最大値を初期値に設定
  min_val = 1025;  // 区画ポテンシャル最大値+1 255*4+4 +1 =1025

  // 周囲４つの方向に対して優先度を計算し，
  // 一番優先度が高い（値が小さい）区画に移動する．
  // 優先度はポテンシャル，未／既探索，直進方向の順．
  // 例：ポテンシャルが0の場合＝基本優先度は0*4+4=4
  // ※未探索なら-2，直進なら-1の減算方式
  // 4:既探索＆直進以外
  // 3:既探索＆直進
  // 2:未探索＆直進以外
  // 1:未探索＆直進
  // 優先度が同じ結果の場合は北東南西の順に優先される

  // 北方向の優先度の計算
  if(( wall_data & 0x01 ) == 0 ){     // 北方向に壁が無いとき
    // 1.ポテンシャルを元に基本優先度を計算
    val = p_map[ pos_x ][ pos_y + 1 ] * 4 + 4;
    // 2.方向による優先度の計算
    // 北方向が進行方向だった場合：-1(優先度を1上げる)
    if( head == 0 )  val -= 1;
    // 3.未探索／既探索による優先度の計算
    // 未探索:-2(優先度を2上げる)，既探索:0
    if(( map[ pos_x ][ pos_y + 1 ] & 0xf0 ) != 0xf0 )  val -= 2;
    // 最小値の更新
    if( val < min_val ){
      min_val = val;
      motion = 0;  // 移動すべき方向を北に設定
    }
  }

  // 東方向の優先度の計算
  if(( wall_data & 0x02 ) == 0 ){     // 東方向に壁が無いとき
    val = p_map[ pos_x + 1 ][ pos_y ] * 4 + 4;
    if( head == 1 )  val -= 1;
    if(( map[ pos_x + 1 ][ pos_y ] & 0xf0 ) != 0xf0 )  val -= 2;
    if( val < min_val ){
      min_val = val;
      motion = 1;  // 移動すべき方向を東に設定
    }
  }

  // 南方向の優先度の計算
  if(( wall_data & 0x04 ) == 0 ){     // 南方向に壁が無いとき
    val = p_map[ pos_x ][ pos_y - 1 ] * 4 + 4;
    if( head == 2 )  val -= 1;
    if(( map[ pos_x ][ pos_y - 1 ] & 0xf0 ) != 0xf0 )  val -= 2;
    if( val < min_val ){
      min_val = val;
      motion = 2;  // 移動すべき方向を南に設定
    }
  }

  // 西方向の優先度の計算
  if(( wall_data & 0x08 ) == 0 ){     // 西方向に壁が無いとき
    val = p_map[ pos_x - 1 ][ pos_y ] * 4 + 4;
    if( head == 3 )  val -= 1;
    if(( map[ pos_x - 1 ][ pos_y ] & 0xf0 ) != 0xf0 )  val -= 2;
    if( val < min_val ){
      min_val = val;
      motion = 3;  // 移動すべき方向を西に設定
    }
  }

  // 移動すべき方向から行動を決定
  motion = ( motion - head ) & 0x03;

  return( motion );
}

//-------------------------------------------------------------------------
//  カウントダウン
//-------------------------------------------------------------------------
void countdown( void ){  
  PIN_WRITE(LED) = LED_OFF;                       // LEDを消灯
  R_SW = LED_OFF;        // 右センサOFF
  L_SW = LED_OFF;        // 左センサOFF
  F_SW = LED_OFF;        // 前センサOFF
  Start_Sound(97);    // カウントダウン音開始
  while( SoundStatus.BIT.SOUND_ON); // 音が鳴り終わるまで待つ
  PIN_WRITE(LED) = LED_ON;                        // LEDを点灯
  R_SW = LED_ON;         // 右センサON
  L_SW = LED_ON;         // 左センサON
  F_SW = LED_ON;         // 前センサON
}

//-------------------------------------------------------------------------
//  速度選択
//-------------------------------------------------------------------------
void select_speed(short *speed){
  short set_speed = *speed;
  LCD_print(8, "V:      ");
  while (1) {
    LCD_dec_out(10, set_speed, 4);
    if ( PIN_READ(SW_UP) == SW_ON ) { // UPボタン
      set_speed += 100;
      if ( set_speed > ACC_TABLE_SIZE ) set_speed = 0;
      WaitKeyOff(); // チャタリング防止
    }
    if ( PIN_READ(SW_DOWN) == SW_ON ) { // DOWNボタン
      set_speed -= 100;
      if ( set_speed < 0 ) set_speed = ACC_TABLE_SIZE;
      WaitKeyOff(); // チャタリング防止
    }
    if ( PIN_READ(SW_EXEC) == SW_ON ) { // 決定ボタン
      *speed = set_speed;
      break;
    }
    if ( PIN_READ(SW_RETURN) == SW_ON ) { // 戻るボタン
      break;
    }
  }
  return;
}

//-------------------------------------------------------------------------
//  ゴール選択
//-------------------------------------------------------------------------
void select_goal(int *gx, int *gy){
  // ゴール座標設定
  int goal_num = goal_find_index(*gx, *gy);
  if( goal_num < 0 ) goal_num = 0;
  LCD_print(8, "x:  y:  ");
  while (1) {
    LCD_dec_out(10, goals[goal_num][0], 1);
    LCD_dec_out(14, goals[goal_num][1], 1);
    if ( PIN_READ(SW_UP) == SW_ON ) { // UPボタン
      goal_num++;
      if ( goal_num >= GOAL_NUM ) goal_num = 0;
      WaitKeyOff(); // チャタリング防止
    }
    if ( PIN_READ(SW_DOWN) == SW_ON ) { // DOWNボタン
      goal_num--;
      if ( goal_num < 0 ) goal_num = GOAL_NUM - 1;
      WaitKeyOff(); // チャタリング防止
    }
    if ( PIN_READ(SW_EXEC) == SW_ON ) { // 決定ボタン
      *gx = goals[goal_num][0];
      *gy = goals[goal_num][1];
      break;
    }
    if ( PIN_READ(SW_RETURN) == SW_ON ) { // 戻るボタン
      break;
    }
  }
  return;
}

#ifdef __cplusplus
void abort(void){

}
#endif
